---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchFailurePlanes
source: html/5d0ebbf8-0da0-fc23-5a02-7da20980fd5d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchFailurePlanes Property

Sketch is no longer parallel to its defining plane

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchFailurePlanes { get; }
```